#include "ItemController.h"


//-----------------------------------
//コンストラクタ
//-----------------------------------
ItemController::ItemController()
{

}

//-----------------------------------
//デストラクタ
//-----------------------------------
ItemController::~ItemController()
{

}
//-----------------------------------
//アイテムの生成
//-----------------------------------
void ItemController::SpawnItem() 
{

}

//-----------------------------------
//アイテムの並び替え
//-----------------------------------
void ItemController::SortItem()
{

}