#include "DxLib.h"
#include "Torrent.h"


//-----------------------------------
//コンストラクタ
//-----------------------------------
Torrent::Torrent()
{

}

//-----------------------------------
//デストラクタ
//-----------------------------------
Torrent::~Torrent()
{

}

//-----------------------------------
//更新
//-----------------------------------
void Torrent::Update()
{

}

//-----------------------------------
//アイドル状態
//-----------------------------------
void Torrent::Idol()
{

}

//-----------------------------------
//移動
//-----------------------------------
void Torrent::Move(const Location player_location)
{

}

//-----------------------------------
//攻撃
//-----------------------------------
void  Torrent::Attack()
{
	
}


//-----------------------------------
//攻撃が当たっているか
//-----------------------------------
AttackResource Torrent::HitCheck(const BoxCollider* collider)
{
	AttackResource ret = { 0,nullptr,0 }; //戻り値

	return ret;
}

//-----------------------------------
//死亡
//-----------------------------------
void Torrent::Death()
{

}

//-----------------------------------
//プレイヤーの弾との当たり判定
//-----------------------------------
bool Torrent::HitBullet(const BulletBase* bullet)
{
	bool ret = false; //戻り値

	return ret;
}

//-----------------------------------
//描画
//-----------------------------------
void Torrent::Draw() const
{

}

//-----------------------------------
//座標の取得
//-----------------------------------
Location Torrent::GetLocation() const
{
	return location;
}