#include "DxLib.h"
#include "Torrent.h"


//-----------------------------------
//コンストラクタ
//-----------------------------------
Torrent::Torrent(Player* player)
{

}

//-----------------------------------
//デストラクタ
//-----------------------------------
Torrent::~Torrent()
{

}

//-----------------------------------
//更新
//-----------------------------------
void Torrent::Update()
{

}

//-----------------------------------
//アイドル状態
//-----------------------------------
void Torrent::Idol()
{

}

//-----------------------------------
//移動
//-----------------------------------
void Torrent::Move(const Location player_location)
{

}

//-----------------------------------
//攻撃
//-----------------------------------
AttackResource Torrent::Attack(const BoxCollider* collider)
{
	AttackResource ret = { 0,nullptr,0 }; //戻り値

	return ret;
}

//-----------------------------------
//死亡
//-----------------------------------
void Torrent::Death()
{

}

//-----------------------------------
//プレイヤーの弾との当たり判定
//-----------------------------------
void Torrent::HitBullet(const BulletBase* bullet)
{

}

//-----------------------------------
//描画
//-----------------------------------
void Torrent::Draw() const
{

}

//-----------------------------------
//状態の取得
//-----------------------------------
TORRENT_STATE Torrent::GetState() const
{
	return state;
}